read_verilog ../project_template.v
read_liberty -lib ../../yosys_sky130/lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
synth -top project_template
dfflibmap -liberty ../../yosys_sky130/lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty ../../yosys_sky130/lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
clean
write_verilog project_template_synth.v
write_spice project_template_synth.sp
show
