read_verilog case_notfull_assigns.v
read_liberty -lib ../../lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
synth -top case_notfull_assigns
abc -liberty ../../lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
show
