read_verilog ../2x1mux.v
read_liberty -lib ../../yosys_sky130/lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
synth -top mux2X1
dfflibmap -liberty ../../yosys_sky130/lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty ../../yosys_sky130/lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
clean
write_verilog 2x1mux_synth.v
write_spice 2x1mux_synth.sp
show
