read_verilog ../dff.v
read_liberty -lib ../../yosys_sky130/lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
synth -top dff
dfflibmap -liberty ../../yosys_sky130/lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty ../../yosys_sky130/lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
clean
write_verilog dff_synth.v
write_spice dff_synth.sp
show
